src/test/java/jMeter/test.yml
execution:
- iterations: 1
  concurrency: 1
  ramp-up: 1s
  scenario: with_script

scenarios:
  with_script:
    script: /Users/carlos-pardo/.jenkins/workspace/LocalPipeline/src/test/java/jMeter/jmeterdemo.jmx
    
reporting:
- module: final-stats
  dump-xml: /Users/carlos-pardo/.jenkins/workspace/TaurusJenkins/stats.xml
- module: passfail
  criterias:
    - avg-rt>250ms for 30s, continue as failed
    - failures>10% for 10s, continue as failed
    - failures>70% for 15s, stop as failed